Backend/app/controllers/entries_controller.rb

  def create
    @entry = Entry.new(entry_params)

    if @entry.save
---
INSERT INTO "entries" ("phrasebook_id", "phrase_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["phrasebook_id", 1], ["phrase_id", 1], ["created_at", "2020-02-21 17:19:52.533903"], ["updated_at", "2020-02-21 17:19:52.533903"]]