Backend/app/controllers/nations_controller.rb

SELECT "nations".* FROM "nations"
---
  def index
    @nations = Nation.all