Backend/app/controllers/phrasebooks_controller.rb

  def index
    @phrasebooks = Phrasebook.all
---
SELECT "phrasebooks".* FROM "phrasebooks"

  def create

    language = params[:language]
    newLang = Language.find_by(name: language)

    language_id = newLang.id
    @phrasebook = Phrasebook.new(user_id: phrasebook_params[:user_id], average_score: phrasebook_params[:average_score], language_id: language_id)

    if @phrasebook.save
---
SELECT "languages".* FROM "languages" WHERE "languages"."name" = ? LIMIT ?  [["name", "Italian"], ["LIMIT", 1]]
INSERT INTO "phrasebooks" ("language_id", "average_score", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["language_id", 46], ["average_score", 0], ["created_at", "2020-02-26 01:24:00.160687"], ["updated_at", "2020-02-26 01:24:00.160687"], ["user_id", 1]]

  def update
    if @phrasebook.update(phrasebook_params)
---
UPDATE "phrasebooks" SET "user_id" = ?, "updated_at" = ? WHERE "phrasebooks"."id" = ?  [["user_id", 1], ["updated_at", "2020-02-23 17:08:16.108552"], ["id", 1]]

    def set_phrasebook
      @phrasebook = Phrasebook.find(params[:id])
---
SELECT "phrasebooks".* FROM "phrasebooks" WHERE "phrasebooks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]