Backend/app/controllers/phrases_controller.rb

SELECT "phrases".* FROM "phrases"
---
  def index
    @phrases = Phrase.all

INSERT INTO "phrases" ("category", "input", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category", "food"], ["input", "banana"], ["created_at", "2020-02-21 02:07:06.635003"], ["updated_at", "2020-02-21 02:07:06.635003"]]
SELECT "phrases".* FROM "phrases" WHERE "phrases"."input" = ? LIMIT ?  [["input", "What's your name?"], ["LIMIT", 1]]
---
  def create

    input = params[:input]
    @phrase = Phrase.find_or_create_by(input: input)