Backend/app/controllers/user_nations_controller.rb

  def index
    @user_nations = UserNation.all
---
SELECT "user_nations".* FROM "user_nations"