Backend/app/controllers/user_phrasebooks_controller.rb

SELECT "user_phrasebooks".* FROM "user_phrasebooks"
---
  def index
    @user_phrasebooks = UserPhrasebook.all