Backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def decode
    @currentUser = User.find_by(id: current_user)

SELECT "nations".* FROM "nations" WHERE "nations"."name" = ? LIMIT ?  [["name", "nation"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "email", "password_digest", "nation_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create

    nation = params[:user][:nation]
    newNation = Nation.find_by(name: nation)
    nation_id = newNation.id
    @user = User.new(username: user_params[:username], email: user_params[:email], password: user_params[:password], nation_id: nation_id)



    if @user.save!